def transform_string(number: int) -> str:
    """Возвращает строку вида 'N процентов' с учётом склонения по указанному number"""
    number1 = number - 1
    lis_percen = ("процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов","процент","процента","процента","процента","процентов","процентов","процентов","процентов","процентов","процентов")
    aa = lis_percen[number1]
    percen = aa
    return (F"{number} {percen}")       # 'верните отформатированную строку'


for n in range(1, 101):  # по заданию учитываем только значения от 1 до 100
    print(transform_string(n))